package sum01;

public class BoardNum {
	int FeedBoardNum = 1; //인티그레이트 1개 라이팅 2개는 고정
	int FeedPortNum = 2;
	int SortBoardNum = 2;
//	String IntegratedBoardIP = "127.0.0.1";				//전체보드 ip
//	String[] FeedBoardIP = {"127.0.0.1", "127.0.0.1"};
//	String[] LightingBoardIP = {"127.0.0.1", "127.0.0.1"};
//	String[] SortBoardIP = {"127.0.0.1","127.0.0.1","127.0.0.1","127.0.0.1","127.0.0.1","127.0.0.1","127.0.0.1","127.0.0.1","127.0.0.1","127.0.0.1","127.0.0.1","127.0.0.1"};
	String IntegratedBoardIP = "10.0.1.1";				//전체보드 ip 1.1
	//String[] FeedBoardIP = {"10.0.2.1", "10.0.2.2"};
	String[] LightingBoardIP = {"10.0.3.1", "10.0.3.2"};
	//String[] SortBoardIP = {"10.0.4.1","10.0.4.2","10.0.4.3","10.0.4.4","10.0.4.5","10.0.4.6","10.0.4.7","10.0.4.8","10.0.4.9","10.0.4.10","10.0.4.11","10.0.4.12"};
	String[] SortBoardIP = {"10.0.4.1","10.0.4.2","10.0.0.200","10.0.0.200","10.0.0.200","10.0.0.200","10.0.0.200","10.0.0.200","10.0.0.200","10.0.0.200","10.0.0.200","10.0.0.200"};
	String[] FeedBoardIP = {"10.0.2.1", "10.0.0.200"};
}

